; domain
(define (domain aviones)
(:requirements :strips)
(:predicates
	(en ?a ?b) 
	(avion ?a)
	(carga ?c)
	(aeropuerto ?a)
) 
(:action cargar
 :parameters ( ?c ?a ?ap)
 :precondition
	(and (en ?c ?ap) (en ?a ?ap) (carga ?c) (avion ?a) (aeropuerto ?ap))
 :effect
	(and 
		(en ?c ?a) 
		(not (en ?c ?ap))
	)
)
(:action descargar
 :parameters ( ?c ?a ?ap)
 :precondition
	(and (en ?c ?a) (en ?a ?ap) (carga ?c) (avion ?a) (aeropuerto ?ap))
 :effect
	(and 
		(en ?c ?ap) 
		(not (en ?c ?a))
	)
)
(:action volar
 :parameters ( ?a ?origen ?destino)
 :precondition
	(and (en ?a ?origen) (avion ?a) (aeropuerto ?origen) (aeropuerto ?destino))
 :effect
	(and 
		(en ?a ?destino) 
		(not (en ?a ?origen))
	)
)
)

; problem
(define (problem carga2)
  	(:domain aviones)
    (:objects
     	AA01
     	AA02
     	AA03
     	PSS
     	MDZ
     	BRC
     	VINO
     	YERBA
     	CHOCOLATES
    )
	(:init
     	(avion AA01)
     	(avion AA02)
     	(avion AA03)
     	(carga VINO)
     	(carga YERBA)
     	(carga CHOCOLATES)
     	(aeropuerto PSS)
     	(aeropuerto MDZ)
     	(aeropuerto BRC)
     	(en CHOCOLATES BRC )
     	(en VINO MDZ)
     	(en YERBA PSS)
     	(en AA01 PSS)
     	(en AA02 MDZ)
     	(en AA03 BRC)
     )
  	(:goal
     	(and
     		(en YERBA BRC)
     		(en CHOCOLATES MDZ)
     		(en VINO PSS)
         )
    )
)

; plan
1. (cargar yerba aa01 pss)
   deleted: (en yerba pss)
   added: (en yerba aa01)
   goals met: 0 of 3
2. (volar aa01 pss brc)
   deleted: (en aa01 pss)
   added: (en aa01 brc)
   goals met: 0 of 3
3. (cargar chocolates aa01 brc)
   deleted: (en chocolates brc)
   added: (en chocolates aa01)
   goals met: 0 of 3
4. (descargar yerba aa01 brc)
   deleted: (en yerba aa01)
   added: (en yerba brc)
   goals met: 1 of 3
5. (volar aa01 brc mdz)
   deleted: (en aa01 brc)
   added: (en aa01 mdz)
   goals met: 1 of 3
6. (descargar chocolates aa01 mdz)
   deleted: (en chocolates aa01)
   added: (en chocolates mdz)
   goals met: 2 of 3
7. (cargar vino aa01 mdz)
   deleted: (en vino mdz)
   added: (en vino aa01)
   goals met: 2 of 3
8. (volar aa01 mdz pss)
   deleted: (en aa01 mdz)
   added: (en aa01 pss)
   goals met: 2 of 3
9. (descargar vino aa01 pss)
   deleted: (en vino aa01)
   added: (en vino pss)
   goals met: 3 of 3
